InformationRegisters/ИсторияСогласованияЗаказПос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСогласованияЗаказПос</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостояниеЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостояниеЗаказаПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУточнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запущен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ИсторияСогласованияЗаказПос/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(ЗаказПоставщику,Состояние,Комментарий = "") Экспорт 
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПоставщику	= ЗаказПоставщику;
	МенеджерЗаписи.Период			= ТекущаяДата();
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда    
		МенеджерЗаписи.ЗаказПоставщику	= ЗаказПоставщику;
		МенеджерЗаписи.Период 			= ТекущаяДата();
		МенеджерЗаписи.Комментарий      = Комментарий;
		МенеджерЗаписи.Состояние		= Перечисления.СостояниеЗаказаПоставщику[Состояние];
		МенеджерЗаписи.Автор			= ПараметрыСеанса.Пользователь;
		МенеджерЗаписи.СуммаДокумента	= ЗаказПоставщику.СуммаДокумента;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

Функция СогласованиеЗапущено(ЗаказПоставщику) Экспорт
	ПолучитьСрезПервых = СрезПервых(,Новый Структура ("ЗаказПоставщику",ЗаказПоставщику));
	
	Если ПолучитьСрезПервых.Количество() <> 0 Тогда
		Состояние = ПолучитьСрезПервых[0].Состояние;
		Если Состояние = Перечисления.СостояниеЗаказаПоставщику.Запущен Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьТекущийСтатусСогласов5ания(ЗаказПоставщику) Экспорт
	ПолучитьСрезПоследних = СрезПоследних(,Новый Структура ("ЗаказПоставщику",ЗаказПоставщику));
	Если ПолучитьСрезПоследних.Количество() <> 0 Тогда
		Состояние = ПолучитьСрезПоследних[0].Состояние;
		Возврат Состояние;
	Иначе
		Возврат Перечисления.СостояниеЗаказаПоставщику.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция СогласованНаТекущийМомент(ЗаказПоставщику) Экспорт 
	ТекущийСтатус = ПолучитьПоследнее(ТекущаяДата(),Новый Структура("ЗаказПоставщику",ЗаказПоставщику));
	Если ЗначениеЗаполнено(ТекущийСтатус.Состояние) И ТекущийСтатус.Состояние = Перечисления.СостояниеЗаказаПоставщику.Согласовано Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
